Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Only the superuser may change the group of a file arbitrarily; other users may change the group of a file to any group of which that user is a member.
pt_br: Somente o superusuário pode mudar o grupo de um arquivo arbitrário; outros usuários somente podem mudar o grupo de um arquivo para qualquer grupo qual o usuário pertença.

source: See also chown() and chmod().
pt_br: Veja também chown() e chmod().

source: Attempts to change the mode of the file specified by filename to that given in mode.
pt_br: chmod

source: The mode parameter consists of three octal number components specifying access restrictions for the owner, the user group in which the owner is in, and to everybody else in this order.
pt_br: Descrição

source: One component can be computed by adding up the needed permissions for that target user base.
pt_br: Tenta mudar as permissões do arquivo especificado por arquivo para o dado em modo.

source: Number 1 means that you grant execute rights, number 2 means that you make the file writeable, number 4 means that you make the file readable.
pt_br: Note que modo não é necessariamente um número octal, então strings (como "g+w") não funcionarão.

source: You can also read more about modes on UNIX systems with 'man 1 chmod' and'man 2 chmod '.
pt_br: Para garantir que a operação seja bem sucedida é necessário prefixar modo com zero (0):

source: It is probably not the same user you use for normal shell or FTP access.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: See also chown() and chgrp().
pt_br: Veja também chown() e chgrp().

source: This function is an alias of rtrim().
pt_br: Esta função é um alias de rtrim().

source: Attempts to change the owner of the file filename to user user (specified by name or number).
pt_br: Tenta modificar o dono do arquivo para o usuario (nome ou número).

source: Only the superuser may change the owner of a file.
pt_br: Somente o superusuário pode modificar o dono de um arquivo.

source: See also chmod().
pt_br: Veja também chmod().

source: Returns a one-character string containing the character specified by ascii.
pt_br: Retorna uma string de um único caractere contendo o caracter especificado pelo ascii.

source: Example 1. chr() example
pt_br: Exemplo 1. chr() exemplo

source: You can find an ASCII-table over here: http: / /www.asciitable.com.
pt_br: Você pode encontrar uma tabela ASCII-table aqui: http: / /www.asciitable.com.

source: This function complements ord().
pt_br: Esta função complementa ord().

source: See also sprintf() with a format string of %c.
pt_br: Veja também sprintf() com uma string no formato de %c.

source: Changes the root directory of the current process to directory.
pt_br: Muda o diretório raiz (root) do processo atual para o diretorio.

source: It' s not wise to use this function when running in a webserver environment, because it's not possible to reset the root directory to / again at the end of the request.
pt_br: Não é sensato usar esta função quando rodando em um ambiente de um webserver, porque não é possível reiniciar o diretório raiz (root) para / novamente no fim do pedido (request).

source: This function will only function correct when you run PHP as command line too. (CLI)
pt_br: Esta função somente irá funcionar desta forma quando rodando num ambiente CGI.

source: Can be used to split a string into smaller chunks which is useful for e.g. converting base64_encode output to match RFC 2045 semantics.
pt_br: Pode dividir uma string em pequenos pedaços que são úteis para e.g. converter base64_encode output para compatibilizar com semânticas RFC 2045.

# It inserts end (defaults to " ") every chunklen characters (defaults to 76).
source: It inserts end (defaults to "\r\n") every chunklen characters (defaults to 76).
pt_br: Ela insere end (padrão para "\r\n") cada caracater chunklen (padrão para 76).

source: It returns the new string leaving the original string untouched.
pt_br: Ela retorna uma nova string deixando a string original intocada.

source: Example 1. chunk_split() example
pt_br: Exemplo 1. chunk_split() exemplo

source: See also explode(), split() wordwrap() and RFC 2045.
pt_br: Veja também explode(), split() wordwrap() e RFC 2045.

source: This function returns TRUE if the class given by class_name has been defined, FALSE otherwise.
pt_br: Descrição

source: See also get_declared_classes().
pt_br: Esta função retorna TRUE se a classe dada por class_name foi definida, caso contrário retorna FALSE.

source: When you use stat(), lstat(), or any of the other functions listed in the affected functions list (below), PHP caches the information those functions return in order to provide faster performance.
pt_br: Quando você chama stat(), lstat() ou qualquer uma das funções afetadas (listadas abaixo), o PHP mantém em cache as informações que essas funções retornam para melhoria de performance.

source: However, in certain cases, you may want to clear the cached information.
pt_br: Entretanto, em certos casos você pode precisar limpar as informações cacheadas.

source: For instance, if the same file is being checked multiple times within a single script, and that file is in danger of being removed or changed during that script 's operation, you may elect to clear the status cache.
pt_br: Por exemplo, se um mesmo arquivo é verificado várias vezes em um único script, e esse arquivo corre o risco de ser apagado ou modificado durante a operação do script, você precisa limpar os dados do cache.

source: In these cases, you can use the clearstatcache() function to clear the information that PHP caches about a file.
pt_br: Nesses casos, você pode utilizar a função clearstatcache() para limpar todas as informações que o PHP mantém sobre um arquivo.

source: This function caches information about specific filenames, so you only need to call clearstatcache() if you are performing multiple operations on the same filename and require the information about that particular file to not be cached.
pt_br: Esta função guarda infomações sobre arquivos específicos, de forma que você somente precisa chamar clearstatcache() se você estiver realizando várias operações sobre o mesmo arquivo e necessita que a informação sobre esse arquivo em particular não seja cacheada.

source: Affected functions include stat(), lstat(), file_exists(), is_writable(), is_readable(), is_executable(), is_file(), is_dir(), is_link(), filectime(), fileatime(), filemtime(), fileinode(), filegroup(), fileowner(), filesize(), filetype(), and fileperms().
pt_br: As funções afetadas são stat(), lstat(), file_exists(), is_writable(), is_readable(), is_executable(), is_file(), is_dir(), is_link(), filectime(), fileatime(), filemtime(), fileinode(), filegroup(), fileowner(), filesize(), filetype(), e fileperms().

source: Closes the directory stream indicated by dir_handle.
pt_br: Fecha o stream do diretório indicado por dir_handle.

source: The stream must have previously been opened by opendir().
pt_br: O stream deve ter sido previamente aberto por opendir().

source: (PHP 4)
pt_br: compact

source: compact() takes a variable number of parameters.
pt_br: Descrição

source: Each parameter can be either a string containing the name of the variable, or an array of variable names.
pt_br: Cada parâmetro pode ser tanto uma string contendo o nome da variável, como um array com nomes de variáveis.

source: The array can contain other arrays of variable names inside it; compact() handles it recursively.
pt_br: Sendo um array, ele pode conter outros arrays de nomes de variáveis; compact() trata isso recursivamente.

source: For each of these, compact() For each of these, compact() looks for a variable with that name in the current symbol table and adds it to the output array such that the variable name becomes the key and the contents of the variable become the value for that key.
pt_br: Para cada um dos parâmetros passados, compact() procura uma variável com o nome especificado na tabela de símbolos e a adiciona no array de saída de forma que o nome da variável será a chave e o seu conteúdo será o valor para esta chave.

source: In short, it does the opposite of extract().
pt_br: Em resumo, ela faz o oposto de extract().

source: It returns the output array with all the variables added to it.
pt_br: Retorna um array de saída com todas as variáveis adicionadas a ele.

source: Any strings that are not set will simply be skipped.
pt_br: Qualquer string com nome de uma variável que não exista será simplesmente ignorada.

source: Example 1. compact() example
pt_br: Exemplo de compact()

source: $city = "San Francisco"; $state = "CA"; $event = "SIGGRAPH"; $location_vars = array ("city", "state"); $result = compact ("event", "nothing_here", $location_vars);
pt_br: $cidade = "Sao Paulo"; $estado = "SP"; $evento = "SIGGRAPH"; $localidade = array ("cidade", "estado"); $result = compact ("evento", "nada_aqui", $localidade);

source: After this, $result will be:
pt_br: Depois disso, $result será:

source: Array ([event] = SIGGRAPH [city] = San Francisco [state] = CA)
pt_br: Array ([evento] = SIGGRAPH [cidade] = Sao Paulo [estado] = SP)

source: See also extract().
pt_br: Veja também extract().

source: (PHP 3 = 3.0.7, PHP 4)
pt_br: connection_aborted

source: Returns TRUE if client disconnected.
pt_br: Descrição

source: See the Connection Handling description in the Features chapter for a complete explanation.
pt_br: Veja a descrição de Connection Handling no capitulo Features para uma explicação completa.

source: Returns the connection status bitfield.
pt_br: Descrição

source: (PHP 3 = 3.0.7, PHP 4 = 4.0.4)
pt_br: connection_timeout

source: Deprecated
pt_br: Descrição

source: This function is deprecated, and doesn 't even exist anymore as of 4.0.5.
pt_br: Obsoleta

source: constant() will return the value of the constant indicated by name.
pt_br: A função constant() irá retornar o valor de uma constante indicada pelo parâmetro name.

source: constant() is useful if you need to retrieve the value of a constant, but do not know it's name. i.e.
pt_br: A função constant() é útil se você precisa pegar o valor de uma constante, mas não sabe o seu nome.

source: It is stored in a variable or returned by a function.
pt_br: Ex: esta guardada em uma variável ou é retornada por uma função.

source: Example 1. constant() example
pt_br: Exemplo constant()

source: ?php define ("MAXSIZE", 100); echo MAXSIZE; echo constant("MAXSIZE"); / / same thing as the previous line?
pt_br: ?php define ("MAXSIZE", 100); echo MAXSIZE; echo constant("MAXSIZE"); / / mesma coisa que a linha anterior?

source: See also define(), defined() and the section on Constants.
pt_br: Veja também define(), defined() e a seção sobre Constantes.

source: This function returns the given string converted from one Cyrillic character set to another.
pt_br: Esta função retorna a string dada convertida de um caracter cirílico para outro.

source: The from and to arguments are single characters that represent the source and target Cyrillic character sets.
pt_br: Os argumentos from e to são caracteres simples que representam o original e o caractere Cirílico de destino.

source: The supported types are:
pt_br: Os tipos suportados são:

source: Makes a copy of a file.
pt_br: Faz uma cópia de um arquivo.

source: Returns TRUE if the copy succeeded, FALSE otherwise.
pt_br: Retorna TRUE se a copia é obtida com sucesso, caso contrário FALSE.

source: Example 1. copy() example
pt_br: Exemplo 1. exemplo do copy()

# if (!copy($file, $file .'.bak')) {print ("failed to copy $file... br ");}
source: if (!copy($file, $file .'.bak')) {print ("failed to copy $file... br \n");}
pt_br: if (!copy($arquivo, $arquivo .'.bak')) {print ("erro copiando arquivo $arquivo... br \n");}

source: As of PHP 4.3.0, both source and dest may be URLs if the "fopen wrappers" have been enabled.
pt_br: A partir do PHP 4.0.3, ambos origem e destino podem ser URLs se "fopen wrappers" estiver ativo.

source: See fopen() for more details.
pt_br: Veja fopen() para mais detalhes.

source: If dest is an URL, the copy operation may fail if the wrapper does not support overwriting of existing files.
pt_br: Se dest é uma URL, a operação de cópia pode falhar se o wrapper não suportar a sobrescrita de arquivos existentes.

source: If the destination file already exists, it will be overwritten.
pt_br: Se o arquivo destino já existir, ele será sobrescrito.

source: See also move_uploaded_file(), rename(), and the section of the manual about handling file uploads.
pt_br: See also move_uploaded_file(), rename(), e a seção do manual sobre manipulação de uploads de arquivos.

source: Returns the hyperbolic cosine of arg, defined as (exp(arg) + exp(-arg)) / 2.
pt_br: Retorna o coseno hiperbólico de arg, definido por (exp(arg) + exp(-arg)) / 2.

source: See also cos(), acosh(), sin() and tan().
pt_br: Veja também cos(), acosh(), sin() e tan().

source: cos() returns the cosine of the arg parameter.
pt_br: cos() retorna o coseno de arg.

source: The arg parameter is in radians.
pt_br: O parametro arg deve estar em radianos.

source: See also acos(), sin() tan() and deg2rad().
pt_br: Veja também acos(), sin() tan() e deg2rad().

source: The optional parameter Mode default to 0.
pt_br: Descrição

source: 0 - an array with the byte-value as key and the frequency of every byte as value.
pt_br: O parâmetro original Mode por definição 0.

source: 1 - same as 0 but only byte-values with a frequency greater than zero are listed.
pt_br: 0 - Uma matriz com um byte-value como chave e a freqüência de cada byte como valor.

source: 2 - same as 0 but only byte-values with a frequency equal to zero are listed.
pt_br: 1 - mesmo que o 0 mas apenas byte-values com freqüência maior do que 0 são listadas.

source: 3 - a string containing all used byte-values is returned.
pt_br: 2 - mesmo que 0 mas apenas byte-values com freqüência igual a 0 são listadas.

source: 4 - a string containing all not used byte-values is returned.
pt_br: 3 - uma string contendo todos os byte-values usados.

source: See also strpos() and substr_count().
pt_br: 4 - uma string contendo todos os byte-values que não foram usados.

source: Returns the number of elements in var, which is typically an array (since anything else will have one element).
pt_br: Retorna o número de elementos de var, que normalmente é um array (uma vez que qualquer outra coisa terá apenas um elemento).

source: If var is not an array, 1 will be returned (exception: count (NULL) equals 0).
pt_br: Se var não for um array, 1 será retornado (excessão: count (NULL) retorna 0).

source: count() may return 0 for a variable that isn't set, but it may also return 0 for a variable that has been initialized with an empty array.
pt_br: count() pode retornar 0 para uma variável que não existe, mas também pode retornar 0 para uma variável que tenha sido inicializada como um array vazio.

source: Use isset() to test if a variable is set.
pt_br: Use isset() para checar se a variável existe.

source: Please see the Arrays section of the manual for a detailed explanation of how arrays are implemented and used in PHP.
pt_br: Por favor, veja a sessão Arrays do manual para uma explicação mais detalhada sobre como os arrays são implementados e utilizados no PHP.

source: Example 1. count() example
pt_br: Exemplo de count()

source: See also is_array(), isset(), and strlen().
pt_br: Veja também is_array(), isset() e strlen().

source: (PHP 3 = 3.0.8, PHP 4)
pt_br: cpdf_begin_text

source: The cpdf_begin_text() function starts a text section.
pt_br: Description

source: Text output
pt_br: Exemplo 1.

source: The cpdf_close() function closes the pdf document.
pt_br: Description

source: The cpdf_open() function opens a new pdf document.
pt_br: Description

source: The cpdf_save() function saves the current environment.
pt_br: Description

source: (PHP 4 = 4.0.6)
pt_br: cpdf_set_font_directories

source: The cpdf_set_text_rendering() function determines how text is rendered.
pt_br: Description

source: (PHP 3 = 3.0.9, PHP 4)
pt_br: cpdf_set_viewer_preferences

source: (PHP 4 = 4.0.5)
pt_br: crack_getlastmessage

source: (PHP 4 = 4.0.1)
pt_br: crc32

source: Example 1.
pt_br: Gera o polinômio cyclic redundancy checksum de 32-bit de comprimento do str.

source: ?php $checksum = crc32( "The quick brown fox jumped over the lazy dog ."); printf("%u\n", $checksum);?
pt_br: É usado geralmente para validar a integridade de um dado sendo transferido.

source: See also md5()
pt_br: Veja também md5()

source: crypt() will return an encrypted string using the standard Unix DES -based encryption algorithm or alternative algorithms that may be available on the system.
pt_br: crypt() retornará uma string criptografada usando o algoritmo de encriptação Unix Standard DES -based ou ou algoritmos alternativos disponíveis no sistema.

source: Arguments are a string to be encrypted and an optional salt string to base the encryption on.
pt_br: Os argumentos são uma string para ser criptografada e uma string opcional para basear em qual encriptação está.

source: See the Unix man page for your crypt function for more information.
pt_br: Veja a página de encriptação Unix para mais informação.

source: If the salt argument is not provided, one will be randomly generated by PHP.
pt_br: Se o argumento salt não é fornecido, um argumento aleatório será gerado pelo PHP.

source: Some operating systems support more than one type of encryption.
pt_br: Alguns SO suportam mais de um tipo de codificação.

source: In fact, sometimes the standard DES-based encryption is replaced by an MD5-based encryption algorithm.
pt_br: De fato, algumas vezes a codificação Standard DES-based é substituído por MD5-based.

source: The encryption type is triggered by the salt argument.
pt_br: O tipo de codificação é definido pelo argumento salt.

source: At install time, PHP determines the capabilities of the crypt function and will accept salts for other encryption types.
pt_br: Na instalação, o PHP determina as possíveis funções de codificação e aceitará salts para outros tipos.

source: If no salt is provided, PHP will auto-generate a standard two character salt by default, unless the default encryption type on the system is MD5, in which case a random MD5-compatible salt is generated.
pt_br: Se nenhum salt é fornecido, o PHP auto-gera um salt padrão de 2 caracateres por definição, a menos que o tipo de codificação padrão do sistema seja MD5, nesse caso um salt MD5-compatible aleatório será gerado.

source: PHP sets a constant named CRYPT_SALT_LENGTH which tells you whether a regular two character salt applies to your system or the longer twelve character salt is applicable.
pt_br: O PHP define uma constante com nome CRYPT_SALT_LENGTH que dirá se um salt de 2 caracteres aplica-se ao seu sistema ou se o salt mais comprido de 12 caracteres é aplicavél.

source: If you are using the supplied salt, you should be aware that the salt is generated once.
pt_br: Se você está usando um salt fornecido, você está ciente que o salt é gerado uma vez.

source: If you are calling this function recursively, this may impact both appearance and security.
pt_br: Se você está chamando essa função repetidamente, isto pode afetar a aparência e a segurança.

source: The standard DES-based encryption crypt() returns the salt as the first two characters of the output.
pt_br: O Standard DES-based crypt() O Standard DES-based crypt() retorna o salt como o primeiro two characters da saída.

source: It also only uses the first eight characters of str, so longer strings that start with the same eight characters will generate the same result (when the same salt is used).
pt_br: Ele também usa apenas os oito primeiros caracteres da str, então strings longas que começam com os mesmos oito caracteres gerarão o mesmo resultado (quando o mesmo salt é usado).

source: On systems where the crypt() function supports multiple encryption types, the following constants are set to 0 or 1 depending on whether the given type is available:
pt_br: Em sistemas onde a função crypt() suporta variados tipos de codificação, as seguintes funções são definidas para 0 ou 1 a depender se um dado tipo está disponível:

source: CRYPT_STD_DES - Standard DES-based encryption with a two character salt
pt_br: CRYPT_STD_DES - Codificação Standard DES-based com um salt de 2 caracteres

source: CRYPT_EXT_DES - Extended DES-based encryption with a nine character salt
pt_br: CRYPT_EXT_DES - Codificação Extended DES-based com um salt de 9 caracateres

source: CRYPT_MD5 - MD5 encryption with a twelve character salt starting with $1$
pt_br: CRYPT_MD5 - Codificação MD5 com um salt de 12 caracteres começando com $1$

source: CRYPT_BLOWFISH - Blowfish encryption with a sixteen character salt starting with $2$
pt_br: CRYPT_BLOWFISH - Codificação Blowfish com um salt de 16 caracteres começando com $2$

source: There is no decrypt function, since crypt() uses a one-way algorithm.
pt_br: Não há função de decodificação, desde que crypt() utiliza uma algorimo de um só caminho.

source: Example 1. crypt() examples
pt_br: Exemplo 1. crypt() exemplos

source: See also md5() and the Mcrypt extension.
pt_br: Veja também md5() e the Mcrypt extension.

source: Every array has an internal pointer to its "current" element, which is initialized to the first element inserted into the array.
pt_br: Todo array tem um ponteiro interno para o elemento "atual", o qual é inicializado para apontar para o primeiro elemento inserido em um array.

source: The current() function simply returns the array element that's currently being pointed by the internal pointer.
pt_br: A função current() simplesmente retorna o elemento do array para o qual esse ponteiro interno está apontando.

source: It does not move the pointer in any way.
pt_br: Não move o ponteiro de forma alguma.

source: If the internal pointer points beyond the end of the elements list, current() returns FALSE.
pt_br: Se o ponteiro interno estiver apontando para além do final da lista de elementos, current() retorna FALSE.

source: If the array contains empty elements (0 or "", the empty string) then this function will return FALSE for these elements as well.
pt_br: Se o array contêm elementos vazios (0 ou "", uma string vazia) então esta função retorna FALSE para esses elementos.

source: This makes it impossible to determine if you are really at the end of the list in such an array using current().
pt_br: Isso faz com que seja impossível determinar se você está realmente no final da lista de elementos de um array usando current().

source: To properly traverse an array that may contain empty elements, use the each() function.
pt_br: Para percorrer devidamente um array que pode conter elementos vazios, use a função each().

source: (PHP 4 = 4.1.0)
pt_br: cyrus_authenticate

source: In otherwords, timestamp is optional and defaults to the value of time().
pt_br: Descrição

source: The valid range of a timestamp is typically from Fri, 13 Dec 1901 20:45:54 GMT to Tue, 19 Jan 2038 03:14:07 GMT. (These are the dates that correspond to the minimum and maximum values for a 32-bit signed integer).
pt_br: Retorna uma string de acordo com o formato da string usando o inteiro dado timestamp ou a a hora corrente local se nenhum timestamp é dado.

source: On windows this range is limited from 01-01-1970 to 19-01-2038.
pt_br: Nota:

source: Additionally, some databases have functions to convert their date formats into timestamps (such as MySQL's UNIX_TIMESTAMP function).
pt_br: A linha válida de um timestamp é tipicamente de Fri, 13 Dec 1901 20:45:54 GMT to Tue, 19 Jan 2038 03:14:07 GMT. (Estas são as datas que correspodem aos mínimos e máximos valores para um inteiro de 32-bit definido).

source: format character
pt_br: No windows esta linha é limitada de 01-01-1970 para 19-01-2038.
